{
  "architectures": [
    "ShatteredShardsQwen3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "dtype": "float16",
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 40960,
  "max_window_layers": 28,
  "model_type": "qwen3_shatteredshards4B",
  "num_attention_heads": 16,
  "num_hidden_layers": 28,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "4.56.2",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936,
  "dynamic_kv_cache": true,
  "kv_cache_manager_config": {
    "decay_type": "exponential",
    "importance_metric": "learned",
    "window_size": 4096,
    "decay_factor": 0.97,
    "importance_power": 1.2,
    "min_decay": 0.15,
    "enable_importance": true,
    "enable_compression": false,
    "compression_ratio": 0.5,
    "enable_adaptive_window": true,
    "max_context_length": 8192,
    "min_window_size": 1024,
    "max_window_size": 8192,
    "adaptation_strategy": "hybrid"
  }
}